In [2]:
import numpy as np
import pandas as pd

In [4]:
ds1=  pd.DataFrame   ( { "names":['Ali','Amir','Aslam'],"wights":['65','67','69'] } )

ds2 = pd.DataFrame ( { "names":['Ali','Amir','Aslam'], "heights":['5.5','5.7','5.9'] } )

ds3 = pd.DataFrame   ( { "names":['Ali','Amir','Aslam'], "ages" : ['25','27','29'] })

In [10]:
dt=pd.merge(ds1,ds2)
print(dt)

   names wights heights
0    Ali     65     5.5
1   Amir     67     5.7
2  Aslam     69     5.9

In [11]:
dx=pd.merge(dt,ds3)
print(dx)

   names wights heights ages
0    Ali     65     5.5   25
1   Amir     67     5.7   27
2  Aslam     69     5.9   29

In [13]:
dx.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      object
 1   wights   3 non-null      object
 2   heights  3 non-null      object
 3   ages     3 non-null      object
dtypes: object(4)
memory usage: 72.0+ bytes

In [14]:
dx.describe()

       names wights heights ages
count      3      3       3    3
unique     3      3       3    3
top      Ali     65     5.5   25
freq       1      1       1    1

In [16]:
da=pd.merge(ds1,ds3)
print(da)

   names wights ages
0    Ali     65   25
1   Amir     67   27
2  Aslam     69   29

In [17]:
da.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   wights  3 non-null      object
 2   ages    3 non-null      object
dtypes: object(3)
memory usage: 60.0+ bytes

In [18]:
da.describe()

       names wights ages
count      3      3    3
unique     3      3    3
top      Ali     65   25
freq       1      1    1

In [19]:
db=pd.merge(ds2,ds3)
print(db)

   names heights ages
0    Ali     5.5   25
1   Amir     5.7   27
2  Aslam     5.9   29

In [20]:
db.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      object
 1   heights  3 non-null      object
 2   ages     3 non-null      object
dtypes: object(3)
memory usage: 60.0+ bytes

In [21]:
db.describe()

       names heights ages
count      3       3    3
unique     3       3    3
top      Ali     5.5   25
freq       1       1    1

In [22]:
dc=pd.merge(ds1,db)
print(dc)

   names wights heights ages
0    Ali     65     5.5   25
1   Amir     67     5.7   27
2  Aslam     69     5.9   29

In [23]:
dc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      object
 1   wights   3 non-null      object
 2   heights  3 non-null      object
 3   ages     3 non-null      object
dtypes: object(4)
memory usage: 72.0+ bytes

In [24]:
dc.describe()

       names wights heights ages
count      3      3       3    3
unique     3      3       3    3
top      Ali     65     5.5   25
freq       1      1       1    1